#!/usr/bin/env bats

readonly TARGET_COMMAND="../bin/unko.any"

@test "引数がない場合はヘルプを出力する" {
  run "$TARGET_COMMAND"
  [ "$status" -eq 0 ]
}

@test "引数が1つのときは💩の置換のみ" {
  run "$TARGET_COMMAND" あ
  [ "$status" -eq 0 ]
  [ "${lines[0]}" = "＿人人人人人人＿" ]
  [ "${lines[1]}" = "＞　突然の死　＜" ]
  [ "${lines[2]}" = "￣Y^Y^Y^Y^Y^Y^￣" ]
  [ "${lines[3]}" = "　　　　　　👑" ]
  [ "${lines[4]}" = "　　　　（あああ）" ]
  [ "${lines[5]}" = "　　　（あ👁あ👁あ）" ]
  [ "${lines[6]}" = "　　（あああ👃あああ）" ]
  [ "${lines[7]}" = "　（ああああ👄ああああ）" ]
}

@test "引数が2つのときは💩の置換と文言変更" {
  run "$TARGET_COMMAND" あ い
  [ "$status" -eq 0 ]
  [ "${lines[0]}" = "＿人人人＿" ]
  [ "${lines[1]}" = "＞　い　＜" ]
  [ "${lines[2]}" = "￣Y^Y^Y^￣" ]
  [ "${lines[3]}" = "　　　　　　👑" ]
  [ "${lines[4]}" = "　　　　（あああ）" ]
  [ "${lines[5]}" = "　　　（あ👁あ👁あ）" ]
  [ "${lines[6]}" = "　　（あああ👃あああ）" ]
  [ "${lines[7]}" = "　（ああああ👄ああああ）" ]
}

@test "引数に /" {
  run "$TARGET_COMMAND" /
  [ "$status" -eq 0 ]
  [ "${lines[0]}" = "＿人人人人人人＿" ]
  [ "${lines[1]}" = "＞　突然の死　＜" ]
  [ "${lines[2]}" = "￣Y^Y^Y^Y^Y^Y^￣" ]
  [ "${lines[3]}" = "　　　　　　👑" ]
  [ "${lines[4]}" = "　　　　（///）" ]
  [ "${lines[5]}" = "　　　（/👁/👁/）" ]
  [ "${lines[6]}" = "　　（///👃///）" ]
  [ "${lines[7]}" = "　（////👄////）" ]
}

@test "引数に \\" {
  run "$TARGET_COMMAND" '\\'
  [ "$status" -eq 0 ]
  [ "${lines[0]}" = '＿人人人人人人＿' ]
  [ "${lines[1]}" = '＞　突然の死　＜' ]
  [ "${lines[2]}" = '￣Y^Y^Y^Y^Y^Y^￣' ]
  [ "${lines[3]}" = '　　　　　　👑' ]
  [ "${lines[4]}" = '　　　　（\\\）' ]
  [ "${lines[5]}" = '　　　（\👁\👁\）' ]
  [ "${lines[6]}" = '　　（\\\👃\\\）' ]
  [ "${lines[7]}" = '　（\\\\👄\\\\）' ]
}

@test "ASCIIコード表33~127まででの置換 (\\は除外)" {
  grep -o . <<< '!"#$%&'"'"'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`abcdefghijklmnopqrstuvwxyz{|}~' | while read -r ch; do
    run "$TARGET_COMMAND" "$ch"
    [ "$status" -eq 0 ]
    [ "${lines[0]}" = "＿人人人人人人＿" ]
    [ "${lines[1]}" = "＞　突然の死　＜" ]
    [ "${lines[2]}" = "￣Y^Y^Y^Y^Y^Y^￣" ]
    [ "${lines[3]}" = "　　　　　　👑" ]
    [ "${lines[4]}" = "　　　　（$ch$ch$ch）" ]
    [ "${lines[5]}" = "　　　（$ch👁$ch👁$ch）" ]
    [ "${lines[6]}" = "　　（$ch$ch$ch👃$ch$ch$ch）" ]
    [ "${lines[7]}" = "　（$ch$ch$ch$ch👄$ch$ch$ch$ch）" ]
  done
}
